{
  "backend/main.mo": "Main Motoko actor defining the backend canister with user profile CRUD, video upload/purchase logic, and access-controlled endpoints using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the admin-only 'Admin Dashboard' button on the Profile page (for secret username SHUBOWNER2026) is implemented in ProfilePage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each page or component's purpose and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the Streamora SPA, mounting the React app at the #root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React app file that builds the TanStack Router route tree with auth guards, admin guards, theme sync, and all page routes wrapped in authenticated or admin layouts.",
  "frontend/src/components/AdSlot.tsx": "Reusable ad placeholder component that displays a mock advertisement with an optional countdown timer and skip button after a configurable delay.",
  "frontend/src/components/AnalyticsCard.tsx": "Presentational card component for displaying a single analytics metric with a label, value, optional icon, and optional colored badge.",
  "frontend/src/components/AppHeader.tsx": "Fixed top navigation header with the Streamora logo, a debounced search input with live suggestion dropdown, and navigation to search results or video detail pages.",
  "frontend/src/components/AuthenticatedLayout.tsx": "Layout wrapper for authenticated pages that composes AppHeader, a main content area with top/bottom padding, and BottomNav.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to Home, Shorts, Upload, Notifications, and Profile, highlighting the active route and showing an unread notification badge.",
  "frontend/src/components/EmbedVideoPlayer.tsx": "Renders an embedded iframe video player for YouTube or Rumble URLs, converting the URL to an embed format via a utility function.",
  "frontend/src/components/GoPremiumButton.tsx": "Displays a 'Go Premium' button that shows a timed popup with pricing details and a contact email when clicked, auto-dismissing after 4 seconds.",
  "frontend/src/components/MonetizationBadge.tsx": "Small badge component that displays a checkmark icon to indicate a monetized creator, with configurable size.",
  "frontend/src/components/NotificationItem.tsx": "Renders a single notification item with category-specific icons and colors (payment, monetization, strike, general), marking it as read on click.",
  "frontend/src/components/PremiumBadge.tsx": "Displays a styled crown badge indicating Premium or Lifetime Premium membership status.",
  "frontend/src/components/StrikeWarning.tsx": "Shows an alert banner with escalating warning messages based on the number of strikes (1–3) a user has received.",
  "frontend/src/components/TrustedBadge.tsx": "Renders a small 'Trusted Creator' badge with a shield icon and blue styling.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail card with title, uploader name, view count, and upload time, linking to the video detail page.",
  "frontend/src/components/VideoPlayer.tsx": "Custom HTML5 video player with ad phase management (pre-roll, mid-roll, end-roll) for non-premium users, including play/pause, mute, seek, and fullscreen controls.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context with session state, login/logout actions, admin flag, and active site event, persisting session via local storage utilities.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all major data operations (videos, user stats, notifications, monetization/payout requests) using localStorage-backed store functions.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind with OKLCH-based CSS custom properties for dark/light theming, and defines utility classes for branding, glass effects, and scrollbars.",
  "frontend/src/lib/auth.ts": "Implements a localStorage/sessionStorage-based username and password authentication system with user registration, login, session management, and a hardcoded admin account.",
  "frontend/src/lib/store.ts": "Provides a localStorage-backed data store with CRUD functions for videos, comments, notifications, monetization requests, payout requests, user stats, site events, and subscriptions.",
  "frontend/src/lib/utils.ts": "Exports utility functions for class name merging, number/currency formatting, relative time display, and converting YouTube/Rumble URLs to embed URLs.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutMonetizationPage.tsx": "Displays the Streamora Creator Program info page, including eligibility criteria (100 subscribers, 1K views), Standard (55%) and Premium (70%) revenue share plans, and a CTA to apply for monetization.",
  "frontend/src/pages/AdminCreatorManagementPage.tsx": "Admin page for searching users and editing their creator settings (CPM rank, premium status, trusted status, monetization approval), sending notifications on status changes, and saving updates via mutations.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin control panel dashboard showing summary stats (total users, pending monetization requests, pending payouts) and navigation links to all admin sub-pages.",
  "frontend/src/pages/AdminEmbedVideoPage.tsx": "Admin form page for embedding external YouTube or Rumble videos into the platform, with fields for URL, title, thumbnail, description, tags, and a promoted toggle.",
  "frontend/src/pages/AdminEventControlPage.tsx": "Admin page for starting and stopping site-wide themed events (Holiday, Dark Mode, Golden), applying the corresponding CSS theme class to the document body and persisting the active event state.",
  "frontend/src/pages/AdminMonetizationRequestsPage.tsx": "Admin page for reviewing monetization requests, allowing admins to approve or reject them, which updates user stats and sends notifications accordingly.",
  "frontend/src/pages/AdminNotificationSenderPage.tsx": "Admin page with a form to send categorized notifications to all users or a specific user, using a target selector, category dropdown, and message textarea.",
  "frontend/src/pages/AdminPayoutRequestsPage.tsx": "Admin page for reviewing payout requests, allowing admins to approve or reject them with corresponding user notifications and toast feedback.",
  "frontend/src/pages/AdminStrikesPanelPage.tsx": "Admin page for issuing strikes to users by searching and selecting them; strike 3 deletes all their videos and disables monetization at strike 2.",
  "frontend/src/pages/AdminUserStatsEditorPage.tsx": "Admin page for searching users and editing their stats (views, subscribers, earnings, toggles) with a form that saves changes via mutation.",
  "frontend/src/pages/AnalyticsPage.tsx": "User-facing analytics dashboard displaying views, subscribers, earnings, CPM rank, and ad eligibility, with a payout request button available when earnings reach $100.",
  "frontend/src/pages/HomePage.tsx": "Displays a grid of admin-promoted featured videos fetched via `useHomeFeed`, showing skeletons while loading and an empty state when no videos exist.",
  "frontend/src/pages/LoginPage.tsx": "Login form that authenticates users via `loginUser`, stores session with `useAuth`, and redirects admins to `/admin` and regular users to `/home`.",
  "frontend/src/pages/LongVideoMetadataPage.tsx": "Step 2 of the long-video upload flow; collects title, description, tags, and thumbnail, then saves the video record and navigates to the user's profile.",
  "frontend/src/pages/MonetizationPage.tsx": "Monetization settings page that lets eligible users request monetization, enter PayPal email and Ad PIN to activate it, and displays current monetization status if already active.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists the current user's notifications with unread count badge, skeleton loading state, and calls `useMarkNotificationRead` when a notification is tapped.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing avatar, badges, subscriber/view/video counts, and tabbed video lists; supports both own-profile actions (logout, settings) and viewing other users' profiles.",
  "frontend/src/pages/SearchResultsPage.tsx": "Renders search results for a query string taken from URL search params using `useSearchVideos`, with skeleton loading and an empty state for no matches.",
  "frontend/src/pages/ShortsPage.tsx": "Displays a vertical short-video feed with swipe-style navigation; each ShortCard handles play/pause, like, comment, subscribe, share, and mute interactions using local state and store utilities.",
  "frontend/src/pages/SignupPage.tsx": "Registration form page that validates user input, calls registerUser, logs the user in via AuthContext, and redirects to /home on success.",
  "frontend/src/pages/UploadLongVideoPage.tsx": "Step 1 of a two-step long-video upload flow; provides a drag-and-drop file picker with simulated upload progress and stores the resulting object URL in sessionStorage before proceeding.",
  "frontend/src/pages/UploadPage.tsx": "Landing page for content upload that presents two options—long video and short—navigating to their respective upload sub-routes, plus a guidelines section.",
  "frontend/src/pages/UploadShortsPage.tsx": "Single-step short video upload form that collects a video file, title, description, and tags, simulates upload progress, and saves the video record via the useSaveVideo mutation before navigating to /shorts.",
  "frontend/src/pages/VideoDetailPage.tsx": "Detail page for a single video that renders the appropriate player (embedded or direct), handles view tracking, likes, subscriptions, comments, and displays creator stats with loading skeletons.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including fonts, OKLCH-based color palette, border radii, shadows, and keyframe animations for the frontend.",
  "project_state.json": "Project state manifest for Streamora describing its architecture, existing features, known issues, and versioned feature list for a mobile-first video sharing app with admin controls and Supabase storage."
}